#include <stdio.h>
#include <math.h> //необходимо вводить -lm при компиляции

void main()
{
	char *L[] = { "A","B" }, *T[] = { "Re", "Im" };
	double Z[3][2], divider;
	printf("Введите комплексные сопротивления A и B\n");

	for (int i = 0; i < 2; i++)
		for (int j = 0; j < 2; j++)
		{
			printf("%s[%s] = ", T[j], L[i]);
			scanf("%lf", &Z[i][j]);
		}
	if (Z[0][0] == 0 && Z[0][1] == 0 && Z[1][0] == 0 && Z[1][1] == 0)
		printf("Z = 0\n");
	else
	if ((Z[0][0] + Z[1][0] == 0) && (Z[0][1] + Z[1][1] == 0))
		printf("Z = inf\n");
	else
	{
		divider = pow((Z[0][0] + Z[1][0]), 2) + pow((Z[0][1] + Z[1][1]), 2);
		Z[2][0] = ((Z[0][0] * Z[1][0] - Z[0][1] * Z[1][1])*(Z[0][0] + Z[1][0]) + (Z[0][0] * Z[1][1] + Z[1][0] * Z[0][1])*(Z[0][1] + Z[1][1])) / divider;
		Z[2][1] = ((Z[0][0] + Z[1][0])*(Z[0][0] * Z[1][1] + Z[1][0] * Z[0][1]) - (Z[0][0] * Z[1][0] - Z[0][1] * Z[1][1])*(Z[0][1] + Z[1][1])) / divider;
		printf("Z = %.3lf + i%.3lf\n", Z[2][0], Z[2][1]);
	}
}